test/wrk2_wsk/social_network/qps_1000/output_compose-post-merged-async_30.log
Running 10m test @ http://130.127.133.207:32001
  1 threads and 30 connections
  Thread calibration: mean lat.: 7916.581ms, rate sampling interval: 18841ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.07m     2.70m    9.69m    58.49%
    Req/Sec    30.71      3.60    35.00     90.32%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    5.18m 
 75.000%    7.36m 
 90.000%    8.81m 
 99.000%    9.62m 
 99.900%    9.67m 
 99.990%    9.69m 
 99.999%    9.70m 
100.000%    9.70m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   10084.351     0.000000            1         1.00
   75563.007     0.100000         1846         1.11
  132644.863     0.200000         3691         1.25
  194641.919     0.300000         5529         1.43
  253362.175     0.400000         7371         1.67
  310902.783     0.500000         9218         2.00
  336330.751     0.550000        10140         2.22
  362283.007     0.600000        11061         2.50
  388759.551     0.650000        11980         2.86
  414711.807     0.700000        12910         3.33
  441712.639     0.750000        13831         4.00
  455081.983     0.775000        14284         4.44
  466354.175     0.800000        14745         5.00
  477364.223     0.825000        15206         5.71
  500957.183     0.850000        15669         6.67
  514588.671     0.875000        16135         8.00
  520880.127     0.887500        16355         8.89
  528482.303     0.900000        16586        10.00
  534773.759     0.912500        16815        11.43
  543162.367     0.925000        17049        13.33
  549453.823     0.937500        17296        16.00
  552599.551     0.943750        17399        17.78
  555220.991     0.950000        17532        20.00
  558891.007     0.956250        17651        22.86
  562561.023     0.962500        17744        26.67
  565182.463     0.968750        17864        32.00
  567279.615     0.971875        17912        35.56
  568852.479     0.975000        17991        40.00
  569901.055     0.978125        18028        45.71
  572522.495     0.981250        18097        53.33
  573571.071     0.984375        18155        64.00
  574095.359     0.985938        18179        71.11
  574619.647     0.987500        18201        80.00
  576716.799     0.989062        18240        91.43
  577765.375     0.990625        18280       106.67
  578289.663     0.992188        18320       128.00
  578289.663     0.992969        18320       142.22
  578289.663     0.993750        18320       160.00
  578813.951     0.994531        18355       182.86
  578813.951     0.995313        18355       213.33
  579338.239     0.996094        18379       256.00
  579338.239     0.996484        18379       284.44
  579338.239     0.996875        18379       320.00
  579338.239     0.997266        18379       365.71
  579862.527     0.997656        18389       426.67
  580386.815     0.998047        18409       512.00
  580386.815     0.998242        18409       568.89
  580386.815     0.998437        18409       640.00
  580386.815     0.998633        18409       731.43
  580386.815     0.998828        18409       853.33
  580911.103     0.999023        18420      1024.00
  580911.103     0.999121        18420      1137.78
  580911.103     0.999219        18420      1280.00
  580911.103     0.999316        18420      1462.86
  580911.103     0.999414        18420      1706.67
  580911.103     0.999512        18420      2048.00
  580911.103     0.999561        18420      2275.56
  580911.103     0.999609        18420      2560.00
  581435.391     0.999658        18426      2925.71
  581435.391     0.999707        18426      3413.33
  581435.391     0.999756        18426      4096.00
  581435.391     0.999780        18426      4551.11
  581435.391     0.999805        18426      5120.00
  581435.391     0.999829        18426      5851.43
  581435.391     0.999854        18426      6826.67
  581435.391     0.999878        18426      8192.00
  581435.391     0.999890        18426      9102.22
  581435.391     0.999902        18426     10240.00
  581435.391     0.999915        18426     11702.86
  581435.391     0.999927        18426     13653.33
  581435.391     0.999939        18426     16384.00
  581435.391     0.999945        18426     18204.44
  581959.679     0.999951        18427     20480.00
  581959.679     1.000000        18427          inf
#[Mean    =   304003.580, StdDeviation   =   162183.657]
#[Max     =   581435.392, Total count    =        18427]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%  796.67ms
 75.000%    1.20s 
 90.000%    1.70s 
 99.000%    2.40s 
 99.900%    3.50s 
 99.990%   10.08s 
 99.999%   10.33s 
100.000%   10.33s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     196.223     0.000000            1         1.00
     501.759     0.100000         1866         1.11
     597.503     0.200000         3701         1.25
     612.351     0.300000         5542         1.43
     700.927     0.400000         7397         1.67
     796.671     0.500000         9250         2.00
     804.863     0.550000        10141         2.22
     898.047     0.600000        11083         2.50
     993.279     0.650000        11980         2.86
    1097.727     0.700000        12926         3.33
    1203.199     0.750000        13835         4.00
    1298.431     0.775000        14282         4.44
    1394.687     0.800000        14762         5.00
    1410.047     0.825000        15204         5.71
    1504.255     0.850000        15677         6.67
    1600.511     0.875000        16133         8.00
    1670.143     0.887500        16354         8.89
    1699.839     0.900000        16605        10.00
    1775.615     0.912500        16816        11.43
    1802.239     0.925000        17067        13.33
    1894.399     0.937500        17282        16.00
    1900.543     0.943750        17403        17.78
    1918.975     0.950000        17506        20.00
    1996.799     0.956250        17633        22.86
    2003.967     0.962500        17738        26.67
    2095.103     0.968750        17853        32.00
    2101.247     0.971875        17931        35.56
    2109.439     0.975000        17969        40.00
    2195.455     0.978125        18026        45.71
    2203.647     0.981250        18097        53.33
    2297.855     0.984375        18146        64.00
    2301.951     0.985938        18170        71.11
    2340.863     0.987500        18198        80.00
    2398.207     0.989062        18227        91.43
    2455.551     0.990625        18255       106.67
    2502.655     0.992188        18285       128.00
    2574.335     0.992969        18298       142.22
    2598.911     0.993750        18313       160.00
    2689.023     0.994531        18327       182.86
    2711.551     0.995313        18341       213.33
    2897.919     0.996094        18356       256.00
    2998.271     0.996484        18363       284.44
    3069.951     0.996875        18370       320.00
    3100.671     0.997266        18377       365.71
    3108.863     0.997656        18384       426.67
    3198.975     0.998047        18392       512.00
    3289.087     0.998242        18396       568.89
    3299.327     0.998437        18400       640.00
    3485.695     0.998633        18402       731.43
    3495.935     0.998828        18406       853.33
    3540.991     0.999023        18410      1024.00
    3583.999     0.999121        18411      1137.78
    3801.087     0.999219        18413      1280.00
    3835.903     0.999316        18415      1462.86
    3956.735     0.999414        18417      1706.67
    4349.951     0.999512        18420      2048.00
    4349.951     0.999561        18420      2275.56
    4349.951     0.999609        18420      2560.00
    4468.735     0.999658        18421      2925.71
    4526.079     0.999707        18422      3413.33
    5148.671     0.999756        18423      4096.00
    5148.671     0.999780        18423      4551.11
    5410.815     0.999805        18424      5120.00
    5410.815     0.999829        18424      5851.43
   10084.351     0.999854        18425      6826.67
   10084.351     0.999878        18425      8192.00
   10084.351     0.999890        18425      9102.22
   10100.735     0.999902        18426     10240.00
   10100.735     0.999915        18426     11702.86
   10100.735     0.999927        18426     13653.33
   10100.735     0.999939        18426     16384.00
   10100.735     0.999945        18426     18204.44
   10330.111     0.999951        18427     20480.00
   10330.111     1.000000        18427          inf
#[Mean    =      963.066, StdDeviation   =      505.700]
#[Max     =    10321.920, Total count    =        18427]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  18455 requests in 10.00m, 8.43MB read
  Socket errors: connect 0, read 0, write 0, timeout 189
Requests/sec:     30.76
Transfer/sec:     14.39KB